[
{"name": "Senior Python Back End Engineer", "company": "Empresa: Loadsmart", "title": ["Faixa salarial: A combinar", "Estado: Santa Catarina", "Local da vaga: Florianopolis", "Nível: Sênior", "Aceita Remoto?:  Sim ", "Tipo de contratação: PJ"], "description": ["Who we are:", "Loadsmart aims to move more with less. We combine great people and innovative technology to more efficiently move freight throughout North America. Our focus is on designing and building the best tools for our team and our customers, using machine learning models to connect freight with trucks. We automate with algorithms and scale with integrations to better match supply and demand. In doing this we reduce wasted fuel and lost time, cutting out empty miles for motor carriers and providing cost savings and instant booking for shippers.", "Who you are:", "You are curious to impact a 700 billion dollar industry of logistics. You take your impact seriously.  You are passionate about building solutions that create sustainable, resilient, and long-lasting value. You are a first-rate software engineer, with experience and a proven ability to think strategically, creatively, and programmatically to achieve product and business results. You are passionate about developing and you value quality and code maintainability. You are pragmatic and don't pick technologies without considering the benefits for the product and business.", "The role:", "We are looking for a Senior Python Back End Engineer to work remotely based in Brazil or in Florianopolis with Loadsmart.  You'll join us in obsessing about transformational technology as part of our backend team. You should have experience and a proven ability to develop new solutions, build new products, and maintain Python services in production.", "The team:", "We are a growing team of passionate and experienced engineers. We build and maintain services written in Python and Go in AWS Lambda and Kubernetes, using Terraform to manage our infrastructure, Kinesis for event streaming, and several other technologies - we strive to use the best tool that suits our needs. We have public facing APIs as well as internal ones consumed by other teams, which get tested and documented. We have a collaborative work environment, where engineers and team members from different departments pool their knowledge together to help each other grow.", "Key Responsibilities:", "- Discuss good practices for software modularization and feel comfortable suggesting contributions to build our set of internal guidelines and shared code", "- Together with other team members, be responsible for the whole lifecycle of an application or service, from conception, specification, development, testing, support, bug fixing and decommission", "- Take part in the decision making of writing clean and simple architecture design systems and tools", "- Create tests, automation scripts, and configure Continuous Integration tools", "- Assist our less experienced engineers with their questions on Python's features and quirks", "- Collaborate with other team members to work on applications and services written in Python", "- Review Pull Requests from the other members of the team.", "Requisitos", "5+ years of programming experience building and maintaining services, most of them in Python", "Passion. Be passionate about creating clean, highly maintainable, and structured code, supported by unit and integration tests", "- Building blocks. Experience with architectural design patterns for services (client-server, event sourcing, MVC, etc)", "- Collaboration with Front End. Experience developing REST APIs as so you can also collaborate on its definition together with frontend developers", "- Extra points if you have written, deployed and maintained Go services in production", "- Experience with AWS, Kubernetes and Terraform are a plus", "- Communication. You’re very comfortable communicating in English (both written and spoken) - you will work in an international team with native and non native english speakers", "- Native proficiency in Portuguese language", "- Troubleshooting. You're good at identifying the source of bugs, know how to dig into the code that may be causing the outstanding issue, and work to resolve any issues that come up", "- Curiosity. You're keen on learning new technologies and tools as well as evaluating their pros and cons. You're a pragmatic programmer. You ask questions and are hungry to learn more"]},
{"name": "Desenvolvedor Full Stack Remoto", "company": "Empresa: Wivo", "title": ["Faixa salarial: R$ 10.000,01 a R$ 13.000,00", "Estado: São Paulo", "Local da vaga: São Paulo", "Nível: Sênior", "Aceita Remoto?:  Sim ", "Tipo de contratação: PJ"], "description": ["A Wivo é uma startup de inteligência de dados para Marketing e Vendas que ajuda a impulsionar novos negócios em empresas B2B.", "Fazemos isso coletando, analisando e tratando diversos dados de fontes públicas, gerando inteligência para apoiar as estratégias de marketing e vendas.", "Nosso time é 100% remoto, somos um SQUAD multidisciplinar com Product Manager, Designer, Desenvolvedor Frontend  e estamos procurando um Desenvolvedor Full stack para ajudar com Backend e Infraestrutura (Devops). Abaixo algumas das atribuições e responsabilidades da vaga:", "- Desenvolver e sustentar crawlers e parsers (Scrapy + Frontera + Kafka);", "- Desenvolver e sustentar integrações (Python);", "- Desenvolver as APIs que serão usadas internamente e pelos nossos clientes (Flask);", "- Ajudar na integração com o Frontend (React.js);", "- Realizar a manutenção e criação de novas funcionalidades (Python);", "- Desenvolvimento e manutenção de aplicações web (React.js + Flask);", "- Desenvolvimento de funcionalidades no Back-End (Python);", "- Consolidação, tratamento e agregação de dados (Mongo DB + Kafka);", "- Devops utilizando Kubernetes;", "- Google Cloud como principal Cloud provider;", "Requisitos", "- Python (Scrapy, Flask, Frontera)", "- MongoDB", "- PostgreSQL", "- Kubernetes", "- Google Cloud", "- React.js", "- Kafka"]},
{"name": "DESENVOLVEDOR PYTHON JR", "company": "Empresa: CAPITANI IT", "title": ["Faixa salarial: R$ 6.000,01 a R$ 10.000,00", "Estado: São Paulo", "Local da vaga: São Paulo", "Nível: Junior", "Aceita Remoto?:  Não ", "Tipo de contratação: PJ"], "description": ["Desenvolvedores mais jovens, com menos tempo de experiência de mercado, mas que já tenham trabalho com tecnologias mais recentes, como Python, microserviços, e que conheçam #c.", "Requisitos", "Desenvolvedores mais jovens, com menos tempo de experiência de mercado, mas que já tenham trabalho com tecnologias mais recentes, como Python, microserviços, e que conheçam #c."]},
{"name": "Integration Engineer (EDI)", "company": "Empresa: Loadsmart", "title": ["Faixa salarial: A combinar", "Estado: Santa Catarina", "Local da vaga: Florianopolis", "Nível: Junior", "Aceita Remoto?:  Não ", "Tipo de contratação: PJ"], "description": ["Who we are:", "Loadsmart aims to move more with less. We combine great people and innovative technology to more efficiently move freight throughout North America. Our focus is on designing and building the best tools for our team and our customers, using machine learning algorithms to connect cargo with trucks. By better matching supply and demand, we reduce wasted fuel and lost time, cutting out empty miles for motor carriers and providing instant booking for shippers.", "Who you are:", "You believe in game-changing innovations and are excited about reimaging a 700 billion dollar industry.  You are passionate about building solutions that create sustainable, resilient, long-lasting value. You know how to build software and wants to get more experience regarding that in a high tech company.", "The role:", "We are looking for an Integration Engineer focused on EDI to join Loadsmart team.", "EDI - Electronic Data Interchange - is a standardized technology for exchanging documents between companies using well known protocols and formats. You will partner with other engineers to help them to setup, implement and test our EDI integrations.", "Key Responsibilities:", "- Roll up your sleeves and help the team with development tasks for new customer integrations using Python and template languages", "- Actively contribute to and support with tests, both manual and automated", "- Help with tickets and maintenance of EDI integrations", "- Update documentation on our internal Wiki.", "Requisitos", "- Basic Python Knowledge and/or Experience (or other programming language)", "- Good communication skills", "- Fluency in English (both written and spoken)", "- Basic knowledge of TCP/IP and other networking protocols", "- Knowledge of unit tests", "- Some Linux and git experience", "- EDI experience is a plus", "- BS in Computer Science or a related field is also a plus."]},
{"name": "Desenvolvedor Pyhton Senior (Angular)", "company": "Empresa: Mazzatech", "title": ["Faixa salarial: R$ 10.000,01 a R$ 13.000,00", "Estado: São Paulo", "Local da vaga: São Paulo (Chacara Santo Antonio)", "Nível: Sênior", "Aceita Remoto?:  Não ", "Tipo de contratação: CLT"], "description": ["Profissional será contratado pela Mazzatech para atuar alocado em empresa do ramo de Seguros.", "Atuará em uma divisão da empresa voltada para inovação, um laboratório que desenvolve novos projetos.", "Requisitos", "Desenvolvimento em linguagem Python, JavaScript e Angular.", "Conhecimento sobre Docker e Git.", "Desenvolvimento de testes unitários e automatizados.", "Conhecimento sobre deploys automáticos.", "Conhecimentos desejáveis: Conhecimento sobre Chatbots, Watson e Blip.", "Conhecimento sobre AWS, Azure."]},
{"name": "Desenvolvedor", "company": "Empresa: TelessaúdeRS-UFRGS", "title": ["Faixa salarial: R$ 6.000,01 a R$ 10.000,00", "Estado: Rio Grande do Sul", "Local da vaga: Porto Alegre", "Nível: Pleno", "Aceita Remoto?:  Sim ", "Tipo de contratação: CLT"], "description": ["URGENTE, o SUS precisa de Desenvolvedor para lutar contra o COVID-19.", "Você quer ajudar a achatar a curva de evolução da COVID-19 em todo o país? É desenvolvedor e quer produzir algo que agregue valor à saúde das pessoas no Brasil? Venha trabalhar no Time de desenvolvimento da Plataforma TelessaúdeRS, temos uma vaga para contratação imediata de desenvolvedor Pleno ou Sênior para trabalhar na Plataforma TelessaúdeRS, produto fundamental aos nossos teleconsultores para resolverem dúvidas de médicos, enfermeiros e dentistas que atuam na assistência à saúde de todo o Brasil, atualmente toda voltada à COVID-19. Não é essa pessoa mas conhece alguém? Precisamos da  sua ajuda para encontrar essa pessoa com urgência e auxiliar a evitar o colapso do nosso sistema de saúde.", "Requisitos", "- mínimo de 3 anos com experiência em Python", "- pró-atividade", "- rapidez e criatividade na resolução de problemas", "- boa comunicação à distância", "- responsabilidade", "- organização", "Desejável: experiência com métodos ágeis, experiência na área da saúde"]},
{"name": "Data Science/Analytics Nível Pleno – Barueri/SP", "company": "Empresa: Hrsoul", "title": ["Faixa salarial: R$ 6.000,01 a R$ 10.000,00", "Estado: São Paulo", "Local da vaga: Barueri", "Nível: Pleno", "Aceita Remoto?:  Não ", "Tipo de contratação: CLT"], "description": ["Imprescindível experiência com Python e análise de dados;", "Desejáveis conhecimentos em Hadoop, Cloud e metodologias ágeis;", "Graduação em TI ou áreas relacionadas;", "Disponibilidade para atuação em Alphaville – São Paulo.", "Requisitos", "Imprescindível experiência com Python e análise de dados;", "Desejáveis conhecimentos em Hadoop, Cloud e metodologias ágeis;", "Graduação em TI ou áreas relacionadas;", "Disponibilidade para atuação em Alphaville – São Paulo."]},
{"name": "DESENVOLVEDOR PYTHON", "company": "Empresa: CAPITANI IT", "title": ["Faixa salarial: R$ 10.000,01 a R$ 13.000,00", "Estado: São Paulo", "Local da vaga: Chácara Santo Antônio/SP (inicialmente trabalho remoto)", "Nível: Sênior", "Aceita Remoto?:  Não ", "Tipo de contratação: CLT"], "description": ["Desenvolvedor PYTHON com experiência em desenvolvimento de API/Microserviço em Rest com Django ou Flask, Python 3, testes unitários, integração contínua. Experiência em Cloud, preferência para AWS ou Azure. Desejável conhecimento em SQL (PostgreSQL) e noSQL.", "Requisitos", "Desenvolvedor PYTHON com experiência em desenvolvimento de API/Microserviço em Rest com Django ou Flask, Python 3, testes unitários, integração contínua. Experiência em Cloud, preferência para AWS ou Azure. Desejável conhecimento em SQL (PostgreSQL) e noSQL."]},
{"name": "Analista Desenvolvedor Python", "company": "Empresa: Mais Retorno", "title": ["Faixa salarial: R$ 3.000,01 a R$ 6.000,00", "Estado: São Paulo", "Local da vaga: São Paulo", "Nível: Pleno", "Aceita Remoto?:  Sim ", "Tipo de contratação: PJ"], "description": ["Oportunidade para atuar home-office.", "Requisitos", "Somos uma fintech em expansão. Buscamos um profissional que tenha atitude de dono com foco em resultados para o nosso time de TI. Realiza as fases de elaboração de requisitos e da programação de sistemas, desenvolve, testa e implementa. Experiência com ORMs, de preferência Django. Experiência em desenvolvimento de API/Microserviço em Rest com Django ou Flask, Python 3, testes unitários, integração contínua.", "Desejável conhecimento em Cloud, preferência para AWS. Desejável conhecimento em SQL (PostgreSQL) e no SQL."]},
{"name": "Desenvolvedor Back-end Remoto (Pleno ou Senior)", "company": "Empresa: Cargobr", "title": ["Faixa salarial: R$ 6.000,01 a R$ 10.000,00", "Estado: São Paulo", "Local da vaga: Alphaville - Barueri", "Nível: Pleno", "Aceita Remoto?:  Sim ", "Tipo de contratação: PJ"], "description": ["Buscamos um profissional que queira evoluir junto com a empresa. Disponibilizamos um excelente ambiente de trabalho com possibilidade de crescimento e aprendizado. O profissional será responsável por atividades de desenvolvimento, devops e documentação.", "Requisitos", "Requisitos obrigatórios:", "• Habilidades sólidas em Python", "• Experiência em Django", "• Boa compreensão de GIT, Banco de dados e Task Queues", "• Conhecimento em ambientes Unix/Linux", "• Familiar em princípios ágeis", "• Conhecimentos sobre automated building, deployment e testing", "• Conhecimento em REST API", "• Testes automatizados (unittest e pytest)", "Requisitos desejáveis:", "• Conhecimentos sobre django-rest-framework", "• Conhecimentos sobre AWS(SES, EC2, S3, RDS)", "• Conhecimentos sobre ansible e terraform", "• Conhecimentos sobre docker e docker-compose", "• Conhecimentos sobre nginx"]},
{"name": "Back end - Python", "company": "Empresa: Smartgreen", "title": ["Faixa salarial: R$ 3.000,01 a R$ 6.000,00", "Estado: Paraná", "Local da vaga: Curitiba - PR", "Nível: Pleno", "Aceita Remoto?:  Não ", "Tipo de contratação: A combinar"], "description": ["Estamos trabalhando uma posição para Smartgreen, uma empresa de soluções para cidades inteligentes. Atuam mais de 10 anos com integração e automatização de cidades e soluções, através de softwares e redes de conectividade.", "•Smartgreen momento de ampliação do quadro de funcionários.", "•Equipe de TI com 12 profissionais;", "*Atuam com tema inovador – “smart city”; Internet 4.0; IOT; Telemetria; Metodologias Ágeis", "Requisitos", "Imprescindíveis:", "•\tExperiencia profissional com desenvolvimento back end utilizando Python (não somente vivência acadêmica)  e Django", "•\tAtuação com banco de dados, SQL,", "•\tLinux, Git", "Diferenciais:", "•\tConhecimento em GraphQL, Docker"]},
{"name": "Python Developer", "company": "Empresa: Domvs", "title": ["Faixa salarial: R$ 6.000,01 a R$ 10.000,00", "Estado: São Paulo", "Local da vaga: zona sul", "Nível: Pleno", "Aceita Remoto?:  Não ", "Tipo de contratação: A combinar"], "description": ["A DOMVS possui experiência em gestão de empresas, onde efetivamente participam de decisões de negócios embasadas pela utilização estratégica da tecnologia da informação.", "Estamos presentes no Brasil e também em Portugal.", "Requisitos", "Para atuar no desenvolvimento em Phyton em empresa de tecnologia com foco em atendimento a clientes do segmento de seguros, varejo e financeiro/bancos.", "Experiência no desenvolvimento em Python.", "Experiência em desenvolvimento de RPA com e sem ferramentas.", "Conhecimento em programação Python para automação operacional (WebScrapping).", "Desejáveis:", "Desejável conhecimento de React.", "Conhecimento em Django será um diferencial", "Observação importante: O processo ocorrerá de forma remota e o início do candidato também será de forma remota até o fim da quarentena por conta da pandemia."]},
{"name": "Desenvolvedor Python", "company": "Empresa: DOMVS IT", "title": ["Faixa salarial: R$ 10.000,01 a R$ 13.000,00", "Estado: São Paulo", "Local da vaga: Zona Sul", "Nível: Pleno", "Aceita Remoto?:  Não ", "Tipo de contratação: A combinar"], "description": ["Perfil Junior ou Pleno - minimo 2 anos de experiência.", "Atuar na região da Zona Sul.", "Modelo de contratação CLT+Benefícios ou PJ.", "Requisitos", "Nível superior em algum curso de tecnologia concluído ou próximo do término", "Competências técnicas necessárias:", "Experiência em RPA com e sem ferramentas", "Programação Python para automação operacional (WebScrapping).", "Conhecimento desejável:", "Desejável conhecimento de React", "Conhecimento dos framework Django é diferencial."]},
{"name": "Desenvolvedor Python", "company": "Empresa: Assurance IT", "title": ["Faixa salarial: R$ 6.000,01 a R$ 10.000,00", "Estado: São Paulo", "Local da vaga: Zona Sul de São Paulo - SP", "Nível: Sênior", "Aceita Remoto?:  Não ", "Tipo de contratação: PJ"], "description": ["Desejável conhecimento em:", "Conhecimentos de metodologias ágeis (Scrum e KanBan);", "Desenvolvimento Web Responsivo;", "Jira para controle de Projetos Agile;", "CI/CD;", "Swagger.", "Prazo: 05 meses", "Requisitos", "aga: Desenvolvedor Python Sênior", "Local: Golden/ Zona Sul - SP", "Início: Imediato", "Conhecimento técnico:", "Formação superior em áreas relacionadas a tecnologia (Análise de Sistemas, Engenharia de Software), Engenharias, Matemática ou disciplinas afins;", "Desenvolvimento de aplicações utilizando linguagem Python 2 e 3;", "Conhecimento em Django", "Desenvolvimento WEB (HTML, CSS, Javascript, JQuery, TypeScript);", "Conhecimento em arquitetura de microserviços;", "APIs REST, Webservices, e Json;", "Experiência em controle de versionamento com Git;", "Experiência com testes unitários;", "Bancos de dados MySQL, MongoDB e DinamoDB;", "Familiaridade com ambientes de Cloud Computing, preferencialmente AWS;", "API Gateway."]},
{"name": "Engenheir@ de Software Backend", "company": "Empresa: tembici.", "title": ["Faixa salarial: R$ 13.000,01 a R$ 16.000,00", "Estado: São Paulo", "Local da vaga: Pinheiros (Próximo ao metro Faria Lima)", "Nível: Sênior", "Aceita Remoto?:  Não ", "Tipo de contratação: A combinar"], "description": ["Somos uma startup ambiciosa que vai melhorar a qualidade de vida das pessoas que vivem em grandes centros urbanos!", "Estamos crescendo absurdamente, combinando a agilidade, autonomia e alto impacto de uma startup com potencial global!", "O que você irá encontrar aqui, no seu primeiro dia:", "- Um quase ex-monolito em Python com Django que é responsável por fazer a ponte entre os nossos apps nativos (Swift e Kotlin) e o nosso hardware (sim, somos uma startup cool que usa IoT).", "- Times operando em Squads com autonomia para entregar os melhores produtos usando o que melhor lhes convém (Kanban, Scrum, Home Office, TDD). “Be Autonomous, but don't sub-optimize!\"", "- Uma tech stack massa! Estamos usando coisas com Lambda/Cloud Functions, Firebase, ELK, Docker e por ai vai… Spoiler: Migrando para uma arquitetura event-driven! Afinal, são centenas de gigas gerados todos os dias!", "O que esperamos de você:", "- Muito mais do que uma lista de “o que esperamos de você” ou “principais atividades ou requisitos”, “Diferenciais”, queremos pessoas mais inteligentes que a gente e que nos digam o que e como vão fazer para tornar nossos produtos ainda melhores!", "- Queremos muito alguém que tope desafios e goste de aprender! Se você for uma pessoa que manda bem em Python e quer ajudar a manter o que já temos e/ou criar funcionalidades novas pro nosso backend, a gente precisa conversar!😊", "RESPONSABILIDADES E ATRIBUIÇÕES", "O que vamos te oferecer, além do blablabla usual:", "- Problemas criativos a serem resolvidos - sério, temos vários que ainda não sabemos resolver!", "- Lidar com novas tecnologias, quando possível - não somos uma empresa de pesquisa mas sempre que dá buscamos novas maneiras de encantar nossos usuários", "- Cool place, cool people - o nosso rooftop é massa (usamos de verdade). Ah, não trabalhamos com pessoas chatas.", "- Feedback Constante - seja através das Squads, Chapters ou Coach. Transparência faz parte dos nossos valores", "- Um propósito e uma oportunidade de mudar a vida de milhões de pessoas - a gente acredita que trabalho tem que ser muito mais do que só pra ajudar a pagar os boletos no final do mês", "Requisitos", "Bom Python com o velho Django na AWS mas esse ta mudando! Precisa mandar bem na construção de APIs, fazendo a comunicação com o IoT e suas estranhezas bem como deixar o time de Mobile feliz!"]}
]